# D2 - 25.11.2025

# Compile code exemple

```prolog
consult('D:\\_Lessons\\HAIWPA\\tutorials\\prolog\\likes.pl').
true.

?- likes(cocacola).
true.

?- likes(pepsi).
false.
```

# Set a folder

```prolog
 ?- cd('D:\\_Lessons\\HAIWPA\\tutorials\\prolog').
```

# Check the folder weâ€™re working on

```prolog
?- pwd.
% d:/_lessons/haiwpa/tutorials/prolog/
true.
```

# Hello World

```prolog
hello :- format('Hello world~n').

hello.
Hello World
true.
```

# Querying a file

## Example file

```prolog
likes(sam, Food) :- indian(Food), mild(Food).
likes(sam, Food) :- chinese(Food).
likes(sam, Food) :- italian(Food).
likes(sam, chips).

indian(curry).
indian(dahl).

mild(dahl).
mild(tandoori).

chinese(chow_mein).
chinese(chop_suey).

italian(pizza).
italian(spaghetti).
```

## Query

If there is more than one answer, we can use `Space` or `;`

```prolog
?- likes(sam, X).
X = dahl ;
X = chow_mein ;
X = chop_suey ;
X = pizza ;
X = spaghetti ;
X = chips.

% What like Sam and that is chinese?
?- likes(sam,X), chinese(X).
X = chow_mein ;
X = chop_suey ;
false.
```

# Editing files inside SWI-Prolog IDE

To edit files, we can use `?- edit(file_name).` . To recompile a saved file, use `make.`

```prolog
?- edit(likes).
true.

?- make.
% d:/_lessons/haiwpa/tutorials/prolog/likes compiled 0.00 sec, 1 clauses
true.
```

# Decompiling

Is it possible to decompile a file using `listing/1` using a predicate as argument.

---

# Knowledge 3

What we know:

- Vicent is happy.
- Butch listens to music,

And we have this rules:

- Vincent plays air guitar if he listens to music `and` he is happy,
- Butch plays air guitar if he listens to music, `or`  if he is happy.

```prolog
happy(vincent).
listens2Music(butch).
playsAirGuitar(vincent):-
   listens2Music(vincent),
   happy(vincent).
playsAirGuitar(butch):-
   happy(butch).
playsAirGuitar(butch):-
   listens2Music(butch).
   
?- playsAirGuitar(vincent).
false.

?- playsAirGuitar(butch).
true.
```

## Or

Or can be written with two ways, using two times the same predicate or by using `;`

```prolog
% same code
playsAirGuitar(butch):-
   happy(butch).
playsAirGuitar(butch):-
   listens2Music(butch).
   
% equals to
playsAirGuitar(butch):-
   happy(butch);
   listens2Music(butch).
```

---

# Arithmetic

```prolog
add(A,B) :-
    Res is A+B, write(A), write(' + '), write(B), write(' = '), writeln(Res).
 
?- add(5,3).
5 + 3 = 8
true.
```